[
    {
        "name": "Outro",
        "trigger": "level_end",
        "level_nid": "1",
        "condition": "True",
        "commands": [],
        "only_once": false,
        "priority": 20,
        "_source": [
            "# Fade to black",
            "transition;Close",
            "change_background;InsideCastle",
            "transition;Open",
            "add_portrait;Tana;Left;no_block",
            "add_portrait;Gilliam;MidRight",
            "speak;Gilliam;Princess Tana.",
            "speak;Tana;Sir Gilliam...|I'm sorry. I never meant to cause you such trouble.",
            "speak;Gilliam;It was no trouble. I live to serve, Princess.",
            "# Move Eirika onscreen from offscreen",
            "add_portrait;Eirika;OffscreenRight;immediate",
            "move_portrait;Eirika;FarRight",
            "speak;Eirika;Tana!",
            "speak;Tana;...Eirika?!?|Is that really you?",
            "speak;Eirika;Tana, what are you doing, so far from Castle Frelia?",
            "# This is how you tell a character to change their expression",
            "expression;Tana;Smile",
            "speak;Tana;I heard that Renais had fallen, and I was so worried...|But I'm glad to see that you're safe...{w}{clear}Wait! Where is Ephraim? Is he well?",
            "expression;Tana;NoSmile",
            "speak;Eirika;I wish I knew.",
            "speak;Tana;You haven't heard from him? Oh, I hope he's not been harmed...|Come, we must go to Castle Frelia. My lord father may know something.",
            "speak;Eirika;Thank you, Tana.",
            "transition;Close",
            "end_skip",
            "",
            "# Let's have some fun in the overworld",
            "change_background",
            "# This command is necessary to load the overworld tilemap",
            "overworld_cinematic;0",
            "# The next two commands are self-explanatory. You'll use these to manipulate overworld data.",
            "reveal_overworld_node;0;immediate",
            "set_overworld_position;Eirika;0",
            "",
            "# Here are examples of overworld animations and sounds.",
            "# Notice that they are the same as the normal tilemap commands.",
            "transition;open;1500",
            "wait;1000",
            "sound;RefreshDance",
            "map_anim;AOE_Mend;2",
            "reveal_overworld_node;2",
            "wait;500",
            "sound;Mend",
            "reveal_overworld_road;0;2",
            "",
            "# Because narration is more involved than dialogue, we need some different commands",
            "# to animate the narration window in.",
            "toggle_narration_mode;open;1000",
            "wait;500",
            "narrate;Narrator;Eirika and her companions have liberated the border castle.",
            "overworld_move_unit;Eirika;2;no_block",
            "narrate;Narrator;Alongside Princess Tana of Frelia, they ride to the Frelian Capital.",
            "wait;500",
            "transition;close",
            "toggle_narration_mode;close",
            "",
            "change_background;Bedroom",
            "wait;1000",
            "transition;open",
            "add_portrait;Hayden;Left",
            "add_portrait;Tana;FarRight",
            "speak;Hayden;Oh, Tana... I'm grateful to see that you're safe and home again! |You've no idea how worried when I heard you were under attack at Border Mulan. |You are not to leave again without my permission. Do you understand?",
            "speak;Tana;Don't be mad, Father. Look, I come bearing good news. |Eirika! Come out now!",
            "add_portrait;Eirika;MidRight",
            "speak;Eirika;King Hayden, I am pleased to see you again, even in these sad times.",
            "speak;Hayden;Ah, Eirika. It does my heart good to see you safe.",
            "speak;Eirika;Thank you. I was able to escape the castle before Renais fell. |But I'm not sure if my father...",
            "speak;Hayden;Yes. |I...have received word of your father.",
            "speak;Eirika;Your Highness? Please tell me. Is my father well?",
            "speak;Hayden;...My friend King Fado...did not survive the fall of Renais Castle.",
            "speak;Eirika;...No, it cannot be...",
            "remove_portrait;Tana",
            "add_portrait;Seth;FarRight",
            "speak;Seth;......",
            "speak;Hayden;Rest assured, Grado will be punished for its cowardly act. This is Frelia's promise. |Eirika, please stay here and rest. I cannot imagine how exhaused you must be.",
            "speak;Eirika;......",
            "speak;Seth;King Hayden. |You know of Prince Ephraim's disappearance, do you not?",
            "speak;Hayden;Yes, we hear the prince and his men hound Grado at every turn. |It's said that he's led his forces into the empire itself. |Reports suggest he's crossed the border and now fights in Renvall.",
            "speak;Eirika;My brother...{br}He fights on? Even now?",
            "speak;Hayden;Yes. My pegasus knights brought his information at a great price. |Even though Renais has fallen, he still charges into the enemy's heart. |He is truly Fado's son...what a valiant youth. |I wish that I knew whether he remains unharmed, but I do not.",
            "speak;Eirika;King Hayden, I thank you for your offer, but I cannot stay. |I intend to ride to my brother's side with reinforcements.",
            "speak;Hayden;I cannot allow it. I know how you feel, but this plan is suicide. |I would be betraying Fado's memory if I allowed any harm to befall you. |Stay here. Rest and mourn. Leave this war to the warriors.",
            "speak;Eirika;I know you mean well, Your Majesty. |However, I have lost my father, and my twin brother is in peril. |My brother, he is a part of me... |I cannot rest here in peace while he risks his life.",
            "speak;Hayden;No. Renais has no more army. Grado's forces decimated it. |I wish that Frelia could provide you with support, with soldiers, but... |My son, Innes, is on his way to meet the empire's forces. |We cannot spare a single brigade. |Your own retinue of knights cannot possibly face Grado alone. |Are you so determined to go?",
            "speak;Eirika;Yes. |...With apologies.",
            "speak;Hayden;...As resolute as your father, eh? |What am I to do in the face of such foolhardy determination? |Vanessa.",
            "remove_portrait;Seth",
            "add_portrait;Vanessa;FarRight",
            "speak;Vanessa;Here, Your Highness!",
            "speak;Hayden;Moulder.",
            "remove_portrait;Vanessa",
            "add_portrait;Moulder;FarRight",
            "speak;Moulder;You called, my king?",
            "speak;Hayden;Gilliam.",
            "remove_portrait;Moulder",
            "add_portrait;Gilliam;FarRight",
            "speak;Gilliam;Yes, sire?",
            "remove_portrait;Gilliam",
            "speak;Hayden;You are to accompany Princess Eirika of Renais into Grado territory. |I expect each of you to provide aid and support for her brother.",
            "add_portrait;Moulder;FarRight",
            "speak;Moulder;Hm. Quite a grave responsibility you have given us.",
            "remove_portrait;Moulder",
            "add_portrait;Vanessa;FarRight",
            "speak;Vanessa;No matter the obstacles, we will perform our duty.",
            "remove_portrait;Vanessa",
            "add_portrait;Gilliam;FarRight",
            "speak;Gilliam;Our lives are yours.",
            "remove_portrait;Gilliam",
            "speak;Hayden;These are some of my most trusted and stalwart vassals. |They will, no doubt, prove themselves quite valuable on your journey. |Remember, you are venturing behind enemy lines. You will need supplies. |I will have a supply convoy readied to carry your weapons and provisions. |It will remain at your side, no matter how far afield you venture.",
            "speak;Eirika;King Hayden, I...{br}Thank you.",
            "speak;Hayden;No, save thanks for your return... with your brother, Prince Ephraim.",
            "speak;Eirika;Yes, Your Highness!",
            "remove_portrait;Eirika",
            "remove_portrait;Hayden",
            "give_money;5000",
            "transition;close;3000",
            "change_background;InsideCastle",
            "transition;open",
            "add_portrait;Eirika;Right",
            "add_portrait;Tana;Left",
            "speak;Tana;Eirika, you don't really intend to go through with this, do you? |I can't guess how you feel, but it's just too dangerous. |What would happen if you were captured by Grado's men?",
            "speak;Eirika;Thank you for your concern, Tana. |But I have no choice. Don't you see, Tana? I have to go.",
            "speak;Tana;Eirika...{br} Oh, why is this happening? What's gone wrong with the world?",
            "speak;Eirika;Tana...",
            "speak;Tana;Why would Grado invade? |Emperor Vigarde is a man of peace. His people adore him. |And you and Ephraim are friends with Prince Lyon, are you not? |What could be behind this madness? Why is this happening...",
            "speak;Eirika;I have no answers for you, Tana. |I don't want to believe it, but the reality is that we are at war. |If I do nothing, I may lose my brother as well as my father. |This is why I have to fight. It's the only answer I have."
        ],
        "nid": "1 Outro"
    }
]