[
    {
        "name": "Intro",
        "trigger": null,
        "level_nid": "A2",
        "condition": "True",
        "commands": [],
        "only_once": false,
        "priority": 20,
        "_source": [
            "#intro",
            "",
            "*Bramar and Nelad enter from the west",
            "",
            "speak;Bramar;Here we are. Looks like the fire nation got here before us.",
            "speak;Nelad;This must be one of the few water tribe settlements on the mainland.|...The outskirst are in ruins...{w} And the whole place is flooded?",
            "speak;Bramar;No reason to hesitate. Let's look for survivors.",
            "speak;Nelad;The smoke and soot are recent|Fire nation soldiers could still be around. We should be cautious.",
            "speak;Bramar;Sure, but if I catch any, I'm wiping them out.",
            "speak;Nelad;Well, I suppose that's unavoidable.",
            "",
            "*Pan to Adriana, Ol and Null approach the temple",
            "",
            "speak;Adriana;Phew! That got pretty messy! Almost had me worried there.",
            "speak;;While they did fight fiercely, the water tribe was no match for the might of the fire nation.",
            "speak;Null;Hardly any trouble! We would've crushed these water weaklings without the help!",
            "speak;Adriana;It was pretty obvious to all what was coming. Thankfully I chose the right side! Besides, I always felt as though we were too passive, unlike the fire nation.",
            "speak;Ol;And for your loyalty to us, we are thankful. I will see to it that you are rightfully rewarded for this.",
            "speak;Adriana;Eheh, I hope so! I'll go retrieve the relics. I just need a small favor from each of you. Ol, I'll need you to stop anyone else from getting in.",
            "speak;Ol;I understand.",
            "speak;Adriana;And Null, I want you to go around and find any stragglers. If you catch any, squeeze the life out of them, got it?",
            "speak;Null;Heh, lettin me have all the fun are ya?",
            "speak;Adriana;Better than having you sitting around all grumpy and angry.",
            "speak;Null;What was that?",
            "speak;Adriana;Ha... well, back to work! Good luck!",
            "speak;Null;Wait! You-",
            "*Adriana enters the temple",
            "speak;Null;Gah!! Damned weakling! Should've crushed her when I had the chance...!",
            "*Null leaves for starting pos",
            "speak;Ol;...Still no sign of him. That man must be punished for his transgression towards prince Zoran. He can't run forever...",
            "",
            "*Pan to Anael exiting from a nearby village",
            "",
            "speak;Anael;Ok... Those people should be alright for now. I have to help those who are still fighting, who knows how much longer they can hold out for?",
            "",
            "*Anael moves to another location but notices Nelad and Bramar standing at the enterance",
            "sound;MapSurprise or something",
            "",
            "speak;Anael;YOU- ...aren't firebenders.",
            "speak;Bramar;Good eye, waterbender.",
            "speak;Anael;I didn't mean to nearly attack you, I'm still on edge.",
            "speak;Nelad;Sorry for startling you. My name is Nelad, and this is my companion, Bramar.",
            "speak;Bramar;Nice to meet you.",
            "speak;Anael;Likewise. I am Anael, and this is... was my village. I'm sorry, I cannot be getting emotional with people I have just met.",
            "speak;Nelad;It is quite alright. As an air nomad I empathize with you. I wasn't there to witness it, but learning of the destruction of my home and loved ones was devastating.",
            "speak;Anael;An air nomad? ...I see. Unfortunately we have no time to mourn, especially not when danger is still present.",
            "speak;Bramar;The fire nation? They're here?",
            "speak;Anael;Yes. We saw their advance and attempted to sink our temple before they could reach it. It contains sacred spirit relics that the fire nation would have been after.",
            "speak;Bramar;Didn't go so well?",
            "speak;Anael;Unfortunately not. Some soldiers might be in there right now, we have to stop them! A-and if we can, save everyone who's left! I-I don't want to lose more family...",
            "speak;Nelad;Don't worry Anael, we'll help you. That was always the plan, although, combat is now assured rather than a possibility. ",
            "speak;Bramar;Let's waste no time then and show the fire nation what for!"
        ],
        "nid": "A2 Intro"
    }
]